close 

x = [0.00,0.056,0.112,0.168,0.224,0.280,0.336,0.392,0.448,0.504,0.560,0.616,0.672,0.728,0.784,0.84,0.896,0.952,0.1008,0.1064,1.12];
y=[0.00,1.66,3.31,4.96,6.6,8.22,9.82,11.4,12.94,14.43,15.86,17.22,18.5,19.69,20.79,21.79,22.7,23.53,24.25,24.87,25.4];


%x=[37 37.5 38 38.5 39 39.5 40 40.5 41 41.5 42 42.5 43];
%y=[3.4 3 3 2.27 2.1 1.83 1.53 1.7 1.8 1.9 2.35 2.54 2.9];
p=polyfit(x,y,2); % 拟合出的二次函数的系数
ye=y-polyval(p,x); % 计算误差
ye2s=sum(ye.^2); % 误差的平方和
disp(sprintf('误差的平方和=%d',ye2s));
xx=linspace(min(x),max(x)); % 绘图用到的点的横坐标
yy=polyval(p,xx); % 拟合曲线的纵坐标
plot(x,y,'o',xx,yy); % 绘图，原始数据+拟合曲线
legend('原始数据','拟合曲线'); % 图示


hold on;

x2 = x;

% %ceres without new CauchyLoss(0.5)
% a = 3.94673;
% b = 13.0947;
% c = 7.20116;

%ceres with new CauchyLoss(0.5)
a = -9.60951;
b = 34.3431;
c = -0.410454;


% %algorithm from csdn C program
% a=-14.176965;
% b=36.495176;
% c= 1.053817;

y2 = a*x.*x+b*x+c;
plot(x2,y2,'o'); % 绘图，原始数据+拟合曲线